src/Catalogs/ТипыОплат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ТипыОплат</Name>
			<Comment>Типы оплат</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОплаты</Name>
					<Comment>Вид оплаты (наличные, безналичные и т.д.)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОплат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОплатыККТ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОплатыККТ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/ВидыОплат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыОплат</Name>
			<Comment>Типы оплаты в рознице</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
					<Comment>Оплата наличными</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
					<Comment>Оплата платежными картами</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кредит</Name>
					<Comment>Оплата в кредит</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КлубнаяКарта</Name>
					<Comment>Оплата клубной картой</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Талон</Name>
					<Comment>Оплата талоном/купоном</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаСчетЗаведения</Name>
					<Comment>Оплата за счет заведения</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ТипыОплат/Ext/ManagerModule.bsl
// Модуль менеджера справочника "Типы оплат"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедура заполнения предопределенных элементов справочника
//
Процедура ВыполнитьНачальноеЗаполнение() Экспорт
	
	// Наличные
	ТипыОплатНаличные = Справочники.ТипыОплат.Наличные.ПолучитьОбъект();
	ТипыОплатНаличные.ТипОплатыККТ = Перечисления.ТипыОплатыККТ.Наличные;
	ТипыОплатНаличные.ВидОплаты = Перечисления.ВидыОплат.Наличные;
	
	// Сохранение справочника
	НовыйЭлемент = ТипыОплатНаличные.ЭтоНовый();
	Если ТипыОплатНаличные.Модифицированность() Тогда
		Попытка
			ТипыОплатНаличные.Записать();
			ВывестиСообщение(НСтр("ru='Справочник ""Типы оплат"". %1 элемент ""%2""'"),,,,, ?(НовыйЭлемент,"Добавлен","Обновлен"), СокрЛП(ТипыОплатНаличные.Наименование));
		Исключение
			ПричинаОшибки(ТипыОплатНаличные);
		КонецПопытки;
	КонецЕсли;
	
	// БезНаличные
	ТипыОплатБезНаличные = Справочники.ТипыОплат.Безналичные.ПолучитьОбъект();
	ТипыОплатБезНаличные.ТипОплатыККТ = Перечисления.ТипыОплатыККТ.Электронно;
	ТипыОплатБезНаличные.ВидОплаты = Перечисления.ВидыОплат.Безналичные;
	
	// Сохранение справочника
	НовыйЭлемент = ТипыОплатБезНаличные.ЭтоНовый();
	Если ТипыОплатБезНаличные.Модифицированность() Тогда
		Попытка
			ТипыОплатБезНаличные.Записать();
			ВывестиСообщение(НСтр("ru='Справочник ""Типы оплат"". %1 элемент ""%2""'"),,,,, ?(НовыйЭлемент,"Добавлен","Обновлен"), СокрЛП(ТипыОплатБезНаличные.Наименование));
		Исключение
			ПричинаОшибки(ТипыОплатБезНаличные);
		КонецПопытки;
	КонецЕсли;
	
	// ЗачетАванса
	ТипыОплатЗачетАванса = Справочники.ТипыОплат.ЗачетАванса.ПолучитьОбъект();
	ТипыОплатЗачетАванса.ВидОплаты = Перечисления.ВидыОплат.ЗаСчетЗаведения;
	ТипыОплатЗачетАванса.ТипОплатыККТ = Перечисления.ТипыОплатыККТ.Предоплата;
	
	// Сохранение справочника
	НовыйЭлемент = ТипыОплатЗачетАванса.ЭтоНовый();
	Если ТипыОплатЗачетАванса.Модифицированность() Тогда
		Попытка
			ТипыОплатЗачетАванса.Записать();
			ВывестиСообщение(НСтр("ru='Справочник ""Типы оплат"". %1 элемент ""%2""'"),,,,, ?(НовыйЭлемент,"Добавлен","Обновлен"), СокрЛП(ТипыОплатЗачетАванса.Наименование));
		Исключение
			ПричинаОшибки(ТипыОплатЗачетАванса);
		КонецПопытки;
	КонецЕсли;
	
	// Кредит
	ТипыОплатКредит = Справочники.ТипыОплат.Кредит.ПолучитьОбъект();
	ТипыОплатКредит.ТипОплатыККТ = Перечисления.ТипыОплатыККТ.Электронно;
	ТипыОплатКредит.ВидОплаты = Перечисления.ВидыОплат.Кредит;
	
	// Сохранение справочника
	НовыйЭлемент = ТипыОплатКредит.ЭтоНовый();
	Если ТипыОплатКредит.Модифицированность() Тогда
		Попытка
			ТипыОплатКредит.Записать();
			ВывестиСообщение(НСтр("ru='Справочник ""Типы оплат"". %1 элемент ""%2""'"),,,,, ?(НовыйЭлемент,"Добавлен","Обновлен"), СокрЛП(ТипыОплатКредит.Наименование));
		Исключение
			ПричинаОшибки(ТипыОплатКредит);
		КонецПопытки;
	КонецЕсли;
	
	// ОплатаВРассрочку
	ТипыОплатОплатаВРассрочку = Справочники.ТипыОплат.ОплатаВРассрочку.ПолучитьОбъект();
	ТипыОплатОплатаВРассрочку.ВидОплаты = Перечисления.ВидыОплат.ЗаСчетЗаведения;
	ТипыОплатОплатаВРассрочку.ТипОплатыККТ = Перечисления.ТипыОплатыККТ.Постоплата;
	
	// Сохранение справочника
	НовыйЭлемент = ТипыОплатОплатаВРассрочку.ЭтоНовый();
	Если ТипыОплатОплатаВРассрочку.Модифицированность() Тогда
		Попытка
			ТипыОплатОплатаВРассрочку.Записать();
			ВывестиСообщение(НСтр("ru='Справочник ""Типы оплат"". %1 элемент ""%2""'"),,,,, ?(НовыйЭлемент,"Добавлен","Обновлен"), СокрЛП(ТипыОплатОплатаВРассрочку.Наименование));
		Исключение
			ПричинаОшибки(ТипыОплатОплатаВРассрочку);
		КонецПопытки;
	КонецЕсли;
	
	// Талон
	ТипыОплатТалон = Справочники.ТипыОплат.Талон.ПолучитьОбъект();
	ТипыОплатТалон.ТипОплатыККТ = Перечисления.ТипыОплатыККТ.Предоплата;
	ТипыОплатТалон.ВидОплаты = Перечисления.ВидыОплат.Талон;
	
	// Сохранение справочника
	НовыйЭлемент = ТипыОплатТалон.ЭтоНовый();
	Если ТипыОплатТалон.Модифицированность() Тогда
		Попытка
			ТипыОплатТалон.Записать();
			ВывестиСообщение(НСтр("ru='Справочник ""Типы оплат"". %1 элемент ""%2""'"),,,,, ?(НовыйЭлемент,"Добавлен","Обновлен"), СокрЛП(ТипыОплатТалон.Наименование));
		Исключение
			ПричинаОшибки(ТипыОплатТалон);
		КонецПопытки;
	КонецЕсли;
	
	// Клубная карта
	ТипыОплатКлубнаяКарта = Справочники.ТипыОплат.КлубнаяКарта.ПолучитьОбъект();
	ТипыОплатКлубнаяКарта.ТипОплатыККТ = Перечисления.ТипыОплатыККТ.Электронно;
	ТипыОплатКлубнаяКарта.ВидОплаты = Перечисления.ВидыОплат.КлубнаяКарта;
	
	// Сохранение справочника
	НовыйЭлемент = ТипыОплатКлубнаяКарта.ЭтоНовый();
	Если ТипыОплатКлубнаяКарта.Модифицированность() Тогда
		Попытка
			ТипыОплатКлубнаяКарта.Записать();
			ВывестиСообщение(НСтр("ru='Справочник ""Типы оплат"". %1 элемент ""%2""'"),,,,, ?(НовыйЭлемент,"Добавлен","Обновлен"), СокрЛП(ТипыОплатКлубнаяКарта.Наименование));
		Исключение
			ПричинаОшибки(ТипыОплатКлубнаяКарта);
		КонецПопытки;
	КонецЕсли;
	
	// ЗаСчетЗаведения
	ТипыОплатЗаСчетЗаведения = Справочники.ТипыОплат.ЗаСчетЗаведения.ПолучитьОбъект();
	ТипыОплатЗаСчетЗаведения.ТипОплатыККТ = Перечисления.ТипыОплатыККТ.Электронно;
	ТипыОплатЗаСчетЗаведения.ВидОплаты = Перечисления.ВидыОплат.ЗаСчетЗаведения;
	
	// Сохранение справочника
	НовыйЭлемент = ТипыОплатЗаСчетЗаведения.ЭтоНовый();
	Если ТипыОплатЗаСчетЗаведения.Модифицированность() Тогда
		Попытка
			ТипыОплатЗаСчетЗаведения.Записать();
			ВывестиСообщение(НСтр("ru='Справочник ""Типы оплат"". %1 элемент ""%2""'"),,,,, ?(НовыйЭлемент,"Добавлен","Обновлен"), СокрЛП(ТипыОплатЗаСчетЗаведения.Наименование));
		Исключение
			ПричинаОшибки(ТипыОплатЗаСчетЗаведения);
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры // ВыполнитьНачальноеЗаполнение()


////////////////////////////////////////////////////////////////////////////////
// ПАРАМЕТРЫ ОБРАБОТКИ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты объекта
	ОбязательныеРеквизиты = Новый Массив();
	ОбязательныеРеквизиты.Добавить("Наименование");
	ОбязательныеРеквизиты.Добавить("ВидОплаты");
	ОбязательныеРеквизиты.Добавить("ТипОплатыККТ");
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Структура уникальных реквизитов
	УникальныеРеквизиты = Новый Структура();
	УникальныеРеквизиты.Вставить("Код");
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ РЕКВИЗИТОВ ШАПКИ


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Производит формирование структуры с доступностью и видимостью команд печати объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандПечати(Объект) Экспорт
	
	// Команды печати могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандПечати()

// Обработчик события формирования печатной формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры // Печать()

#КонецЕсли
